import 'package:discover_trips/models/trip.dart';

class TripRepository {
  List<Trip> get fetchAllTrips => _fetchAllTrips();

  List<Trip> _fetchAllTrips() {
    return [
      Trip(
        name: "جبال الألب",
        id: 1,
        categoryId: 1,
        imageUrl:
            "https://images.pexels.com/photos/544067/pexels-photo-544067.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "جبال الألب هي سلسلة جبال شهيرة في أوروبا، تمتد عبر سويسرا وفرنسا وإيطاليا والنمسا. تشتهر بمناظرها الطبيعية الخلابة وتوفر أنشطة متنوعة مثل التسلق والتزلج. تعتبر وجهة مثالية لمحبي الطبيعة والمغامرات.",
        activities: [
          "تسلق الجبال مع مرشد محترف.",
          "ركوب التلفريك للاستمتاع بالمناظر.",
          "التزلج على الجليد خلال الشتاء.",
          "جولات بالدراجات الجبلية.",
          "التخييم في المناطق الجبلية."
        ],
        program: [
          "اليوم الأول: الوصول إلى المنتجع في الألب وقضاء اليوم في ركوب التلفريك لمشاهدة المناظر الطبيعية، مع وقت حر للاستمتاع بالهواء الجبلي.",
          "اليوم الثاني: تسلق الجبال مع مرشد محترف على مسار مخصص، مع توقف لالتقاط الصور والاستمتاع بالمناظر البانورامية.",
          "اليوم الثالث: ممارسة التزلج على الجليد في إحدى المناطق المجهزة لهذا النشاط، مع مدرب متاح للمبتدئين.",
          "اليوم الرابع: جولة بالدراجات الجبلية على مسارات مخصصة في الطبيعة، مع فترات راحة في النقاط ذات الإطلالات الجميلة.",
          "اليوم الخامس: التخييم في منطقة جبلية مميزة، مع توفير جميع مستلزمات التخييم، وقضاء المساء بجانب النار."
        ],
        loction: "أوروبا",
        season: "الشتاء والصيف",
        tripType: "مغامرات واستكشاف",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "جبل البحر الأحمر",
        id: 2,
        categoryId: 1,
        imageUrl:
            "https://gate.ahram.org.eg/daily/Media/News/2021/7/30/2021-637632787739542178-954.jpg",
        informaion:
            "جبل البحر الأحمر يقع في مصر، تحديدًا في الغردقة ودهب. يتميز بمناظره الطبيعية الفريدة ويوفر مزيجًا من المغامرات والاسترخاء. يعتبر وجهة مثالية لعشاق الطبيعة والتأمل.",
        activities: [
          "استكشاف الكهوف الجبلية.",
          "مشاهدة غروب الشمس من أعلى الجبل.",
          "جلسات تأمل ورياضة اليوغا.",
          "التخييم وسط الصحراء المحيطة.",
          "التقاط صور احترافية للطبيعة."
        ],
        program: [
          "اليوم الأول: استكشاف الكهوف الجبلية بمرافقة دليل محلي مع شرح جيولوجي للمنطقة.",
          "اليوم الثاني: مشاهدة غروب الشمس من نقطة عالية على الجبل، مع جلسة تصوير مميزة.",
          "اليوم الثالث: قضاء يوم في جلسات تأمل ورياضة اليوغا وسط الطبيعة الجبلية الهادئة.",
          "اليوم الرابع: التخييم في الصحراء المحيطة بالجبل، مع عشاء تقليدي وقصص حول النار.",
          "اليوم الخامس: التقاط صور احترافية للطبيعة والجبال في وقت الشروق."
        ],
        loction: "مصر (الغردقة ودهب)",
        season: "على مدار العام",
        tripType: "مغامرات واسترخاء",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "جبل كليمنجارو",
        id: 3,
        categoryId: 1,
        imageUrl:
            "https://images.pexels.com/photos/26924196/pexels-photo-26924196/free-photo-of-an-elephant-in-a-field.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "جبل كليمنجارو يقع في تنزانيا بأفريقيا، وهو أعلى قمة جبلية في القارة. يتميز بتضاريسه المتنوعة، من الغابات إلى القمم الثلجية، ويوفر تجربة فريدة لمحبي المغامرات والطبيعة.",
        activities: [
          "تسلق القمم الثلجية.",
          "تصوير الحياة البرية في الطريق.",
          "التخييم على مراحل أثناء الصعود.",
          "التعرف على القبائل المحلية وثقافتهم.",
          "استكشاف الغابات المحيطة."
        ],
        program: [
          "اليوم الأول: رحلة قصيرة لاستكشاف الغابات المحيطة والتعرف على النباتات والحيوانات المحلية.",
          "اليوم الثاني: البدء في رحلة تسلق القمم الثلجية مع التوقف في محطة استراحة على ارتفاع متوسط.",
          "اليوم الثالث: يوم مخصص للتخييم في موقع مرتفع، مع الاستمتاع بالمشاهد الطبيعية الخلابة.",
          "اليوم الرابع: لقاء مع القبائل المحلية للتعرف على ثقافتهم وتجربة الطعام التقليدي.",
          "اليوم الخامس: تصوير الحياة البرية في الصباح الباكر أثناء العودة إلى أسفل الجبل."
        ],
        loction: "تنزانيا، أفريقيا",
        season: "من يونيو إلى أكتوبر",
        tripType: "مغامرات واكتشاف",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: false,
      ),
      Trip(
        name: "جبال أطلس",
        id: 4,
        categoryId: 1,
        imageUrl:
            "https://images.pexels.com/photos/15360706/pexels-photo-15360706/free-photo-of-landscape-of-palm-trees-and-the-atlas-mountains-in-marrakech-morocco.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "جبال أطلس تقع في المغرب، وتشتهر بمناظرها الطبيعية الخلابة وثقافتها البربرية الغنية. توفر مزيجًا من المغامرات والثقافة، مع أنشطة مثل التخييم وزيارة القرى البربرية.",
        activities: [
          "التجول في القرى البربرية الجبلية.",
          "ركوب البغال والتسلق الخفيف.",
          "التخييم في الوديان.",
          "زيارة شلالات أوزود.",
          "التعرف على الحرف التقليدية لسكان المنطقة."
        ],
        program: [
          "اليوم الأول: التجول في القرى البربرية الصغيرة، والتعرف على نمط حياتهم وعاداتهم.",
          "اليوم الثاني: ركوب البغال والتسلق الخفيف إلى إحدى القمم القريبة.",
          "اليوم الثالث: التخييم في وادٍ بين الجبال، مع تناول العشاء التقليدي بجانب النار.",
          "اليوم الرابع: زيارة شلالات أوزود الشهيرة والاستمتاع بالمياه والمناظر الطبيعية.",
          "اليوم الخامس: زيارة ورش الحرف التقليدية وتجربة صنع المنتجات المحلية مثل الفخار أو السجاد."
        ],
        loction: "المغرب",
        season: "من مارس إلى أكتوبر",
        tripType: "مغامرات وثقافة",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "جبل فوجي",
        id: 5,
        categoryId: 1,
        imageUrl:
            "https://images.pexels.com/photos/3408354/pexels-photo-3408354.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "جبل فوجي يقع في اليابان، وهو أحد أشهر الجبال في العالم. يتميز بمناظره الطبيعية الساحرة والثقافة اليابانية الفريدة. يوفر تجربة مميزة لمحبي المغامرات والاكتشاف.",
        activities: [
          "تسلق الجبل مع التوقف في الأكواخ التقليدية.",
          "زيارة البحيرات الخمس المحيطة.",
          "الاستمتاع بالمهرجانات الثقافية في المنطقة.",
          "تجربة الطعام الياباني المحلي.",
          "التصوير الاحترافي عند شروق الشمس."
        ],
        program: [
          "اليوم الأول: تسلق الجبل والتوقف في أحد الأكواخ التقليدية لتناول الشاي الياباني.",
          "اليوم الثاني: زيارة واحدة من البحيرات الخمس المحيطة والتجول على ضفافها.",
          "اليوم الثالث: حضور مهرجان ثقافي في المنطقة مثل مهرجان 'فوجي شيبا ساكورا'.",
          "اليوم الرابع: تجربة أطباق محلية مثل الرامين والسوشي في مطعم تقليدي.",
          "اليوم الخامس: تصوير شروق الشمس من موقع مميز عند سفح الجبل."
        ],
        loction: "اليابان",
        season: "من يوليو إلى سبتمبر",
        tripType: "مغامرات واكتشاف",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "بحر الكاريبي",
        id: 6,
        categoryId: 2,
        imageUrl:
            "https://aerialbvi.com/wp-content/uploads/2024/04/Antigua-and-Barbuda-1024x576.jpg",
        informaion:
            "بحر الكاريبي يقع في جزر الكاريبي مثل جزر البهاما وجامايكا. يتميز بمياهه الصافية وشواطئه الرملية، ويوفر مزيجًا من الاسترخاء والمغامرات.",
        activities: [
          "السباحة في المياه الصافية.",
          "الغوص لمشاهدة الشعاب المرجانية.",
          "الإبحار بالقوارب الشراعية.",
          "الاسترخاء على الشواطئ الرملية.",
          "تناول الطعام البحري الطازج."
        ],
        program: [
          "اليوم الأول: الاسترخاء على الشاطئ وقضاء الوقت في السباحة بالمياه الصافية.",
          "اليوم الثاني: الغوص لمشاهدة الشعاب المرجانية الملونة والأسماك.",
          "اليوم الثالث: الإبحار بالقوارب الشراعية وتجربة الصيد في البحر.",
          "اليوم الرابع: قضاء اليوم في تناول الأطعمة البحرية الطازجة على الشاطئ.",
          "اليوم الخامس: جولة حرة لاستكشاف المحلات والأسواق المحلية في المنطقة."
        ],
        loction: "جزر الكاريبي",
        season: "على مدار العام",
        tripType: "استرخاء ومغامرات",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "البحر الأحمر",
        id: 7,
        categoryId: 2,
        imageUrl:
            "https://cdn.trailfinders.com/i9qcbovkdb_shutterstock_251998594_1500x1500.jpg?width=600",
        informaion:
            "البحر الأحمر يقع في مصر، تحديدًا في الغردقة وشرم الشيخ. يتميز بمياهه الدافئة والشعاب المرجانية الخلابة، ويوفر أنشطة متنوعة للاسترخاء والمغامرات.",
        activities: [
          "الغوص لاستكشاف الكائنات البحرية.",
          "ركوب الزلاجات المائية (Jet Ski).",
          "السباحة في المياه الدافئة.",
          "الاستمتاع بالرياضات البحرية.",
          "رحلات بحرية بالقوارب الزجاجية."
        ],
        program: [
          "اليوم الأول: الغوص لاستكشاف الشعاب المرجانية المدهشة والكائنات البحرية.",
          "اليوم الثاني: قضاء الوقت في ركوب الزلاجات المائية وتجربة السرعة في المياه.",
          "اليوم الثالث: السباحة في المياه الدافئة مع قضاء وقت للاسترخاء.",
          "اليوم الرابع: ممارسة رياضة التجديف أو الكاياك في البحر.",
          "اليوم الخامس: رحلة بحرية بالقوارب الزجاجية لمشاهدة الأسماك تحت الماء."
        ],
        loction: "مصر (الغردقة وشرم الشيخ)",
        season: "على مدار العام",
        tripType: "مغامرات واسترخاء",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "شاطئ ميامي",
        id: 8,
        categoryId: 2,
        imageUrl:
            "https://images.pexels.com/photos/18638883/pexels-photo-18638883/free-photo-of-city-with-beach-on-sea-shore.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "شاطئ ميامي يقع في الولايات المتحدة الأمريكية، ويشتهر برماله الذهبية وحيويته. يعتبر وجهة مثالية للاسترخاء والترفيه.",
        activities: [
          "حمامات الشمس على الشاطئ.",
          "زيارة النوادي والمقاهي الشاطئية.",
          "ركوب الأمواج.",
          "جولة بالدراجات على الشاطئ.",
          "حفلات موسيقية في الهواء الطلق."
        ],
        program: [
          "اليوم الأول: قضاء الوقت في حمامات الشمس والاسترخاء على الرمال الذهبية.",
          "اليوم الثاني: زيارة أحد المقاهي الشاطئية الشهيرة والاستمتاع بالموسيقى.",
          "اليوم الثالث: ركوب الأمواج مع مدرب خاص للمبتدئين.",
          "اليوم الرابع: جولة بالدراجات على طول الشاطئ في الصباح الباكر.",
          "اليوم الخامس: حضور حفلة موسيقية في الهواء الطلق على الشاطئ."
        ],
        loction: "ميامي، الولايات المتحدة الأمريكية",
        season: "على مدار العام",
        tripType: "استرخاء وترفيه",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "شاطئ بالي",
        id: 9,
        categoryId: 2,
        imageUrl:
            "https://images.pexels.com/photos/2711640/pexels-photo-2711640.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "شاطئ بالي يقع في إندونيسيا، ويشتهر بشواطئه المخفية وطبيعته الخلابة. يعتبر وجهة مثالية للاسترخاء والاكتشاف.",
        activities: [
          "زيارة الشواطئ المخفية (مثل شاطئ نوسا دوا).",
          "تجربة التدليك والعناية الصحية.",
          "الغوص الحر.",
          "الاستمتاع بالغروب.",
          "استكشاف المزارع القريبة (مثل مزارع الأرز)."
        ],
        program: [
          "اليوم الأول: زيارة شاطئ نوسا دوا المخفي والاستمتاع بالعزلة.",
          "اليوم الثاني: تجربة جلسة تدليك بالي التقليدية على الشاطئ.",
          "اليوم الثالث: الغوص الحر في المياه الهادئة لاستكشاف الحياة البحرية.",
          "اليوم الرابع: الاستمتاع بمشاهدة غروب الشمس من أحد المواقع المرتفعة.",
          "اليوم الخامس: جولة لاستكشاف مزارع الأرز والقرى المحيطة بالشاطئ."
        ],
        loction: "إندونيسيا",
        season: "على مدار العام",
        tripType: "استرخاء واكتشاف",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "شاطئ إيبيزا",
        id: 10,
        categoryId: 2,
        imageUrl:
            "https://images.pexels.com/photos/185808/pexels-photo-185808.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "شاطئ إيبيزا يقع في إسبانيا، ويشتهر بحفلاته الليلية وشواطئه الرملية. يعتبر وجهة مثالية للاسترخاء والترفيه.",
        activities: [
          "قضاء الوقت في الشواطئ الرملية.",
          "حفلات شاطئية ليلية.",
          "ركوب القوارب الفاخرة.",
          "الغطس في المياه الصافية.",
          "التسوق في المتاجر المحلية."
        ],
        program: [
          "اليوم الأول: قضاء اليوم على الشاطئ مع السباحة والاسترخاء.",
          "اليوم الثاني: حضور حفلة شاطئية ليلية.",
          "اليوم الثالث: ركوب قارب فاخر لاستكشاف الجزر القريبة.",
          "اليوم الرابع: ممارسة الغطس في المياه الصافية.",
          "اليوم الخامس: جولة تسوق في المتاجر المحلية لشراء الهدايا التذكارية."
        ],
        loction: "إسبانيا",
        season: "من مايو إلى أكتوبر",
        tripType: "استرخاء وحفلات",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: false,
      ),
      Trip(
        name: "بحيرة بايكال",
        id: 11,
        categoryId: 3,
        imageUrl:
            "https://images.pexels.com/photos/8784371/pexels-photo-8784371.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "بحيرة بايكال تقع في سيبيريا، روسيا، وهي أعمق بحيرة في العالم. تشتهر بجمالها الطبيعي الفريد وتوفر أنشطة متنوعة في الصيف والشتاء.",
        activities: [
          "التزلج على الجليد (في الشتاء).",
          "استكشاف الكهوف الجليدية.",
          "جولة بالقوارب في الصيف.",
          "مشاهدة الحياة البرية.",
          "التقاط الصور الطبيعية."
        ],
        program: [
          "اليوم الأول: التزلج على الجليد على سطح البحيرة المتجمد (أو التنقل عبر القوارب في الصيف).",
          "اليوم الثاني: استكشاف الكهوف الجليدية والتعرف على تاريخ البحيرة.",
          "اليوم الثالث: القيام بجولة لرؤية الحياة البرية المحلية مثل الفقمات السيبيرية.",
          "اليوم الرابع: قضاء اليوم في التقاط الصور الطبيعية للمناطق المحيطة بالبحيرة.",
          "اليوم الخامس: جولة حرة لاستكشاف القرى الصغيرة المحيطة بالبحيرة."
        ],
        loction: "سيبيريا، روسيا",
        season: "الصيف والشتاء",
        tripType: "استكشاف ومغامرات",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "بحيرة كومو",
        id: 12,
        categoryId: 3,
        imageUrl:
            "https://images.pexels.com/photos/29848849/pexels-photo-29848849/free-photo-of-picturesque-lake-como-shoreline-in-italy.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "بحيرة كومو تقع في إيطاليا، وتشتهر بجمالها الطبيعي وقصورها التاريخية. تعتبر وجهة مثالية للاسترخاء والاكتشاف.",
        activities: [
          "ركوب القوارب الكلاسيكية.",
          "زيارة القصور التاريخية.",
          "التجول في الحدائق المطلة على البحيرة.",
          "تناول الطعام الإيطالي المحلي.",
          "مشاهدة غروب الشمس."
        ],
        program: [
          "اليوم الأول: جولة بالقوارب الكلاسيكية لاستكشاف البحيرة من جميع الزوايا.",
          "اليوم الثاني: زيارة قصر فيلا كارلوتا واستكشاف تاريخه وحدائقه.",
          "اليوم الثالث: التجول في الحدائق العامة المطلة على البحيرة والاستمتاع بالمناظر الطبيعية.",
          "اليوم الرابع: قضاء اليوم في مطعم مطل على البحيرة لتجربة الطعام الإيطالي.",
          "اليوم الخامس: مشاهدة غروب الشمس من نقطة مرتفعة حول البحيرة."
        ],
        loction: "إيطاليا",
        season: "من أبريل إلى أكتوبر",
        tripType: "استرخاء واكتشاف",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "بحيرة تيتكاكا",
        id: 13,
        categoryId: 3,
        imageUrl:
            "https://i.guim.co.uk/img/media/f05610a38c1366ea31d98d30047fe0117fe108c3/0_0_4495_2697/master/4495.jpg?width=1200&quality=85&auto=format&fit=max&s=7b1f77db704192316f0ec684bb316dbe",
        informaion:
            "بحيرة تيتكاكا تقع بين بيرو وبوليفيا، وهي أعلى بحيرة صالحة للملاحة في العالم. تشتهر بجزرها العائمة وثقافتها الغنية.",
        activities: [
          "زيارة الجزر العائمة.",
          "التعرف على تقاليد السكان المحليين.",
          "ركوب القوارب المصنوعة من القصب.",
          "استكشاف الحياة البرية.",
          "حضور العروض الثقافية."
        ],
        program: [
          "اليوم الأول: زيارة الجزر العائمة المصنوعة من القصب ومقابلة السكان المحليين.",
          "اليوم الثاني: قضاء اليوم مع السكان المحليين للتعرف على تقاليدهم وعاداتهم.",
          "اليوم الثالث: ركوب القوارب المصنوعة يدويًا من القصب للتجول في البحيرة.",
          "اليوم الرابع: القيام بجولة لرؤية الطيور والحيوانات المحلية.",
          "اليوم الخامس: حضور عرض ثقافي يتضمن الموسيقى والرقصات التقليدية."
        ],
        loction: "بين بيرو وبوليفيا",
        season: "على مدار العام",
        tripType: "استكشاف ثقافي وطبيعي",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "بحيرة لوخ نيس",
        id: 14,
        categoryId: 3,
        imageUrl:
            "https://images.pexels.com/photos/5662226/pexels-photo-5662226.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "بحيرة لوخ نيس تقع في اسكتلندا، وتشتهر بأسطورة وحش لوخ نيس. تعتبر وجهة مثالية لعشاق الغموض والطبيعة.",
        activities: [
          "البحث عن وحش لوخ نيس.",
          "ركوب القوارب في البحيرة.",
          "زيارة القلاع المحيطة.",
          "التنزه على طول البحيرة.",
          "التصوير الفوتوغرافي للطبيعة."
        ],
        program: [
          "اليوم الأول: قضاء اليوم في ركوب القوارب للبحث عن وحش لوخ نيس.",
          "اليوم الثاني: زيارة قلعة أوركهارت القريبة والتعرف على تاريخها.",
          "اليوم الثالث: التنزه على طول البحيرة ومشاهدة المناظر الخلابة.",
          "اليوم الرابع: تصوير المناطق الطبيعية المحيطة بالبحيرة.",
          "اليوم الخامس: جولة حرة في المنطقة مع زيارة المتاحف المحلية."
        ],
        loction: "اسكتلندا",
        season: "على مدار العام",
        tripType: "استكشاف وغموض",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "بحيرة بيليتشر",
        id: 15,
        categoryId: 3,
        imageUrl:
            "https://i0.wp.com/jetsettingfools.com/wp-content/uploads/2016/10/Tumbling-waterfall-flows-beneath-path-Plitvice-Lakes-in-Autumn-Croatia.jpg?resize=1024%2C683&ssl=1",
        informaion:
            "بحيرة بيليتشر تقع في كرواتيا، وتشتهر بشلالاتها الطبيعية وهدوئها. تعتبر وجهة مثالية للاسترخاء والاستكشاف.",
        activities: [
          "التنزه بين الشلالات المحيطة.",
          "الاستمتاع بالطبيعة والهدوء.",
          "زيارة الحديقة الوطنية.",
          "التقاط الصور الطبيعية.",
          "قضاء الوقت في المطاعم المحلية."
        ],
        program: [
          "اليوم الأول: التنزه بين الشلالات المحيطة بالبحيرة والاستمتاع بالأجواء.",
          "اليوم الثاني: قضاء يوم في الاسترخاء على ضفاف البحيرة والاستمتاع بالهدوء.",
          "اليوم الثالث: زيارة الحديقة الوطنية والتعرف على تاريخها وطبيعتها.",
          "اليوم الرابع: التقاط الصور للمشاهد الطبيعية والشلالات.",
          "اليوم الخامس: تناول الطعام المحلي في مطاعم تطل على البحيرة."
        ],
        loction: "كرواتيا",
        season: "على مدار العام",
        tripType: "استرخاء واستكشاف",
        isInSummer: true,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "صحراء وادي رم",
        id: 16,
        categoryId: 4,
        imageUrl:
            "https://cdn.alweb.com/thumbs/jordanencyclopedia/article/fit710x532/%D8%A3%D9%87%D9%85-%D8%A7%D9%84%D9%86%D8%B5%D8%A7%D8%A6%D8%AD-%D9%84%D8%B1%D8%AD%D9%84%D8%A9-%D9%88%D8%A7%D8%AF%D9%8A-%D8%B1%D9%85.jpeg",
        informaion:
            "صحراء وادي رم تقع في الأردن، وتشتهر بمناظرها الصحراوية الخلابة وتضاريسها الفريدة. تعتبر وجهة مثالية للمغامرات والاستكشاف.",
        activities: [
          "ركوب الجمال.",
          "التخييم تحت النجوم.",
          "تسلق الصخور.",
          "جولات بسيارات الدفع الرباعي.",
          "تصوير المناظر الطبيعية الصحراوية."
        ],
        program: [
          "اليوم الأول: ركوب الجمال لاستكشاف المناطق المحيطة بوادي رم.",
          "اليوم الثاني: قضاء الليلة في التخييم تحت النجوم.",
          "اليوم الثالث: تسلق الصخور مع مرشد متخصص.",
          "اليوم الرابع: جولة بسيارات الدفع الرباعي في المناطق الرملية والجبال.",
          "اليوم الخامس: التقاط الصور الطبيعية للمناطق المميزة بوادي رم."
        ],
        loction: "الأردن",
        season: "الربيع والخريف",
        tripType: "استكشاف ومغامرات",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "صحراء سيوة",
        id: 17,
        categoryId: 4,
        imageUrl:
            "https://mediaaws.almasryalyoum.com/news/verylarge/2022/12/20/1981787_0.jpeg",
        informaion:
            "صحراء سيوة تقع في مصر، وتشتهر بواحاتها الخلابة والينابيع الساخنة. تعتبر وجهة مثالية للاسترخاء والاستكشاف.",
        activities: [
          "زيارة ينابيع المياه الساخنة.",
          "التزلج على الرمال.",
          "مشاهدة غروب الشمس من جبل الدكرور.",
          "استكشاف المعابد الفرعونية.",
          "تناول الطعام البدوي."
        ],
        program: [
          "اليوم الأول: زيارة ينابيع المياه الساخنة للاسترخاء.",
          "اليوم الثاني: التزلج على الكثبان الرملية الكبيرة.",
          "اليوم الثالث: مشاهدة غروب الشمس من جبل الدكرور.",
          "اليوم الرابع: جولة لاستكشاف المعابد والمواقع الأثرية في الواحة.",
          "اليوم الخامس: تناول الطعام البدوي التقليدي في واحة سيوة."
        ],
        loction: "مصر",
        season: "الشتاء (للطقس المعتدل)",
        tripType: "استرخاء واستكشاف",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "صحراء أتاكاما",
        id: 18,
        categoryId: 4,
        imageUrl:
            "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSESYyfXWtyZa-H-5UzxiA08nT-C6CEBR9J0g&s",
        informaion:
            "صحراء أتاكاما تقع في تشيلي، وتشتهر بظواهرها الطبيعية الفريدة مثل السماء الصافية والوديان القمرية. تعتبر وجهة مثالية للاستكشاف.",
        activities: [
          "مشاهدة السماء ليلاً (أفضل مكان لرؤية النجوم).",
          "زيارة الينابيع الساخنة.",
          "استكشاف البحيرات المالحة.",
          "تصوير الجبال البركانية.",
          "جولة في وديان القمر."
        ],
        program: [
          "اليوم الأول: زيارة الينابيع الساخنة والاسترخاء في المياه الطبيعية.",
          "اليوم الثاني: مشاهدة السماء ليلاً باستخدام التلسكوبات المتوفرة.",
          "اليوم الثالث: جولة لاستكشاف البحيرات المالحة.",
          "اليوم الرابع: تصوير الجبال البركانية والمناظر الطبيعية.",
          "اليوم الخامس: جولة في وديان القمر للتعرف على التضاريس الفريدة."
        ],
        loction: "تشيلي",
        season: "الصيف والربيع",
        tripType: "استكشاف وظواهر طبيعية",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "صحراء موهافي",
        id: 19,
        categoryId: 4,
        imageUrl:
            "https://images.takeshape.io/86ce9525-f5f2-4e97-81ba-54e8ce933da7/dev/1bd59b49-2e5a-48c7-abb5-1f11e47a6e25/433_Joshua%20Tree_2.jpg?auto=compress%2Cformat&w=1600",
        informaion:
            "صحراء موهافي تقع في الولايات المتحدة الأمريكية، وتشتهر بتضاريسها الصحراوية الفريدة. تعتبر وجهة مثالية للمغامرات والاستكشاف.",
        activities: [
          "التخييم في المناطق الصحراوية.",
          "جولات على الطرق الوعرة بالدراجات.",
          "زيارة متنزه وادي الموت.",
          "مشاهدة النباتات الصحراوية الفريدة.",
          "ركوب المناطيد."
        ],
        program: [
          "اليوم الأول: التخييم في موقع مخصص للاستمتاع بالأجواء الصحراوية.",
          "اليوم الثاني: جولة بالدراجات على الطرق الوعرة.",
          "اليوم الثالث: زيارة متنزه وادي الموت واستكشاف معالمه.",
          "اليوم الرابع: مشاهدة النباتات الصحراوية النادرة مثل شجرة جوشوا.",
          "اليوم الخامس: ركوب منطاد للحصول على نظرة شاملة على الصحراء."
        ],
        loction: "الولايات المتحدة الأمريكية",
        season: "الشتاء والربيع",
        tripType: "مغامرات واستكشاف",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "صحراء الربع الخالي",
        id: 20,
        categoryId: 4,
        imageUrl:
            "https://mufhras.com/wp-content/uploads/2022/08/images-2022-08-06T013023.700.jpeg",
        informaion:
            "صحراء الربع الخالي تقع بين السعودية وعُمان والإمارات، وهي أكبر صحراء رملية في العالم. تعتبر وجهة مثالية للمغامرات.",
        activities: [
          "التزلج على الكثبان الرملية.",
          "رحلات بسيارات الدفع الرباعي.",
          "تجربة الحياة البدوية.",
          "الاستمتاع بحفلات الشواء في الصحراء.",
          "التصوير الفوتوغرافي للكثبان الرملية."
        ],
        program: [
          "اليوم الأول: التزلج على الكثبان الرملية العالية.",
          "اليوم الثاني: جولة بسيارات الدفع الرباعي لاكتشاف مناطق جديدة.",
          "اليوم الثالث: تجربة الحياة البدوية من خلال زيارة خيمة تقليدية.",
          "اليوم الرابع: إقامة حفلة شواء ليلية تحت السماء الصافية.",
          "اليوم الخامس: التقاط الصور الاحترافية للكثبان الرملية وقت الشروق."
        ],
        loction: "السعودية وعُمان والإمارات",
        season: "الشتاء (لأن الصيف شديد الحرارة)",
        tripType: "مغامرات",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "غابة الأمازون",
        id: 21,
        categoryId: 5,
        imageUrl:
            "https://images.pexels.com/photos/38136/pexels-photo-38136.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "غابة الأمازون تقع في أمريكا الجنوبية (البرازيل وبيرو وكولومبيا وغيرها)، وهي أكبر غابة مطيرة في العالم. تعتبر وجهة مثالية للاستكشاف والمغامرات.",
        activities: [
          "جولات بالقوارب لاستكشاف الأنهار.",
          "مشاهدة الحيوانات البرية والطيور النادرة.",
          "زيارة القرى المحلية.",
          "التنزه في المسارات الطبيعية.",
          "تعلم تقاليد السكان الأصليين."
        ],
        program: [
          "اليوم الأول: ركوب القوارب لاستكشاف الأنهار المحيطة بالغابة.",
          "اليوم الثاني: مشاهدة الحيوانات البرية مثل القرود والطيور النادرة.",
          "اليوم الثالث: زيارة القرى المحلية والتعرف على حياة السكان الأصليين.",
          "اليوم الرابع: التنزه في المسارات الطبيعية وسط الأشجار العملاقة.",
          "اليوم الخامس: تعلم تقاليد السكان الأصليين مثل صناعة الأدوات اليدوية."
        ],
        loction: "أمريكا الجنوبية",
        season: "الربيع والخريف",
        tripType: "استكشاف ومغامرات",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "غابة شيروود",
        id: 22,
        categoryId: 5,
        imageUrl:
            "https://www.nottinghamworld.com/jpim-static/image/2024/02/29/11/27/Statue_of_Robin_Hood_in_Sherwood_Forest_%289464%29.jpg?trim=0,0,0,0&crop=&width=640&quality=65",
        informaion:
            "غابة شيروود تقع في إنجلترا، وتشتهر بأسطورة روبن هود وأشجارها التاريخية. تعتبر وجهة مثالية للاسترخاء والاستكشاف.",
        activities: [
          "التنزه بين الأشجار التاريخية.",
          "التعرف على أسطورة روبن هود.",
          "ركوب الدراجات في الممرات الطبيعية.",
          "مشاهدة الطيور البرية.",
          "حضور الفعاليات الثقافية."
        ],
        program: [
          "اليوم الأول: التنزه بين الأشجار التاريخية واستكشاف الغابة.",
          "اليوم الثاني: التعرف على أسطورة روبن هود وزيارة المعالم المرتبطة بها.",
          "اليوم الثالث: ركوب الدراجات في الممرات المخصصة.",
          "اليوم الرابع: مشاهدة الطيور البرية والتقاط الصور.",
          "اليوم الخامس: حضور فعالية ثقافية محلية داخل الغابة."
        ],
        loction: "إنجلترا",
        season: "الصيف والخريف",
        tripType: "استرخاء واستكشاف",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "غابة مونتفيردي",
        id: 23,
        categoryId: 5,
        imageUrl:
            "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTLnXWESrDfT0sQsOy8Rz_7GdAwG_oi7ZKsjA&s",
        informaion:
            "غابة مونتفيردي تقع في كوستاريكا، وتشتهر بغاباتها السحابية والحياة البرية المتنوعة. تعتبر وجهة مثالية لعشاق الطبيعة.",
        activities: [
          "المشي على الجسور المعلقة.",
          "مراقبة الحياة البرية والطيور.",
          "زيارة مزارع البن القريبة.",
          "تجربة زيبلينج في الغابة.",
          "التنزه في الغابة السحابية."
        ],
        program: [
          "اليوم الأول: المشي على الجسور المعلقة بين الأشجار.",
          "اليوم الثاني: مراقبة الطيور والحيوانات مثل الكسلان.",
          "اليوم الثالث: زيارة مزارع البن والتعرف على مراحل إنتاجه.",
          "اليوم الرابع: تجربة الزيبلينج فوق الغابة.",
          "اليوم الخامس: التنزه في الغابة السحابية والتقاط الصور."
        ],
        loction: "كوستاريكا",
        season: "الشتاء (لأنها أقل رطوبة)",
        tripType: "استكشاف الطبيعة",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "غابة بلاك فورست",
        id: 24,
        categoryId: 5,
        imageUrl:
            "https://images.squarespace-cdn.com/content/5c471817a2772c47f0e12e79/1673002637728-5ORGHEAE8NYMITXJJHBS/The-Mysterious-Black-Forest--Exploring-Its-Secrets-.jpg?content-type=image%2Fjpeg",
        informaion:
            "غابة بلاك فورست تقع في ألمانيا، وتشتهر بمناظرها الطبيعية الخلابة وحلوياتها التقليدية. تعتبر وجهة مثالية للاسترخاء والاستكشاف.",
        activities: [
          "التنزه في الممرات الجبلية.",
          "زيارة القرى الريفية.",
          "تذوق الحلويات التقليدية مثل كعكة الغابة السوداء.",
          "ركوب القطار البطيء وسط الغابة.",
          "التقاط الصور الطبيعية."
        ],
        program: [
          "اليوم الأول: التنزه في الممرات الجبلية المحيطة بالغابة.",
          "اليوم الثاني: زيارة القرى الريفية الصغيرة للتعرف على التقاليد المحلية.",
          "اليوم الثالث: تجربة الحلويات التقليدية مثل كعكة الغابة السوداء.",
          "اليوم الرابع: ركوب القطار البطيء لمشاهدة الغابة من زوايا مختلفة.",
          "اليوم الخامس: التقاط الصور الاحترافية للغابة وقت الغروب."
        ],
        loction: "ألمانيا",
        season: "الربيع والخريف",
        tripType: "استرخاء واستكشاف",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "غابة باندياجارا",
        id: 25,
        categoryId: 5,
        imageUrl:
            "https://cnn-arabic-images.cnn.io/cloudinary/image/upload/w_780,c_scale,q_auto/cnnarabic/2018/10/19/images/114068.avif",
        informaion:
            "غابة باندياجارا تقع في مالي، وتشتهر بمنحدراتها الجبلية وثقافتها التقليدية. تعتبر وجهة مثالية للاستكشاف الثقافي والطبيعي.",
        activities: [
          "زيارة القرى التقليدية للسكان المحليين.",
          "مشاهدة المنحدرات الجبلية.",
          "التنزه في المسارات الطبيعية.",
          "التعرف على الطقوس التقليدية.",
          "تصوير المعالم الطبيعية والثقافية."
        ],
        program: [
          "اليوم الأول: زيارة القرى التقليدية ومقابلة السكان المحليين.",
          "اليوم الثاني: مشاهدة المنحدرات الجبلية والتقاط الصور.",
          "اليوم الثالث: التنزه في المسارات الطبيعية في الغابة.",
          "اليوم الرابع: التعرف على الطقوس التقليدية التي يمارسها السكان.",
          "اليوم الخامس: التقاط الصور الاحترافية للطبيعة والثقافة المحلية."
        ],
        loction: "مالي",
        season: "الشتاء",
        tripType: "استكشاف ثقافي وطبيعي",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "شلالات نياجرا",
        id: 26,
        categoryId: 6,
        imageUrl:
            "https://images.pexels.com/photos/306381/pexels-photo-306381.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "شلالات نياجرا تقع على الحدود بين الولايات المتحدة وكندا، وتشتهر بجمالها الطبيعي وقوتها المائية. تعتبر وجهة مثالية للاسترخاء والاستكشاف.",
        activities: [
          "ركوب القوارب بالقرب من الشلالات.",
          "المشي في ممشى الشلالات.",
          "تصوير المناظر الطبيعية.",
          "زيارة متحف الشلالات.",
          "مشاهدة الشلالات المضاءة ليلاً."
        ],
        program: [
          "اليوم الأول: ركوب القوارب للوصول إلى أقرب نقطة من الشلالات.",
          "اليوم الثاني: المشي في الممشى المحيط بالشلالات.",
          "اليوم الثالث: زيارة متحف الشلالات للتعرف على تاريخها.",
          "اليوم الرابع: تصوير المناظر الطبيعية لشلالات نياجرا.",
          "اليوم الخامس: مشاهدة عرض الإضاءة الليلي على الشلالات."
        ],
        loction: "الحدود بين الولايات المتحدة وكندا",
        season: "الصيف والخريف",
        tripType: "استرخاء واستكشاف",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "شلالات إجوازو",
        id: 27,
        categoryId: 6,
        imageUrl:
            "https://images.pexels.com/photos/3672776/pexels-photo-3672776.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "شلالات إجوازو تقع على الحدود بين الأرجنتين والبرازيل، وتشتهر بجمالها الطبيعي وقوتها المائية. تعتبر وجهة مثالية للمغامرات والاستكشاف.",
        activities: [
          "المشي في المسارات الطبيعية المحيطة بالشلالات.",
          "ركوب القوارب لاستكشاف الشلالات عن قرب.",
          "مشاهدة قوس قزح فوق الشلالات.",
          "التقاط الصور الاحترافية.",
          "زيارة الحديقة الوطنية المحيطة."
        ],
        program: [
          "اليوم الأول: المشي في المسارات الطبيعية لاكتشاف الشلالات.",
          "اليوم الثاني: ركوب القوارب لرؤية الشلالات من قرب.",
          "اليوم الثالث: مشاهدة قوس قزح الطبيعي فوق الشلالات.",
          "اليوم الرابع: زيارة الحديقة الوطنية المحيطة بالشلالات.",
          "اليوم الخامس: تصوير المناظر الطبيعية والشلالات."
        ],
        loction: "الحدود بين الأرجنتين والبرازيل",
        season: "الربيع والخريف",
        tripType: "استكشاف ومغامرات",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "شلالات أنجل",
        id: 28,
        categoryId: 6,
        imageUrl:
            "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQz2qhSNcif-2u-5gmtFWETf5c_I_-1BPBTQA&s",
        informaion:
            "شلالات أنجل تقع في فنزويلا، وهي أعلى شلالات في العالم. تشتهر بجمالها الطبيعي وتوفر فرصًا رائعة للاستكشاف.",
        activities: [
          "الطيران فوق الشلالات.",
          "التنزه في الغابات المحيطة.",
          "زيارة البحيرات القريبة.",
          "التخييم في الطبيعة.",
          "تصوير الشلالات من زوايا مختلفة."
        ],
        program: [
          "اليوم الأول: ركوب الطائرة لمشاهدة الشلالات من الأعلى.",
          "اليوم الثاني: التنزه في الغابات القريبة من الشلالات.",
          "اليوم الثالث: زيارة البحيرات الصغيرة القريبة من الموقع.",
          "اليوم الرابع: قضاء ليلة في التخييم وسط الطبيعة.",
          "اليوم الخامس: تصوير الشلالات من زوايا متعددة."
        ],
        loction: "فنزويلا",
        season: "الصيف",
        tripType: "استكشاف الطبيعة",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "شلالات فيكتوريا",
        id: 29,
        categoryId: 6,
        imageUrl:
            "https://images.pexels.com/photos/27878405/pexels-photo-27878405/free-photo-of-an-aerial-view-of-the-victoria-falls-in-zimbabwe.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "شلالات فيكتوريا تقع على الحدود بين زامبيا وزيمبابوي، وتشتهر بجمالها الطبيعي وقوتها المائية. تعتبر وجهة مثالية للاستكشاف.",
        activities: [
          "المشي على جسر Knife Edge Bridge.",
          "ركوب قارب في نهر زامبيزي.",
          "مشاهدة الشلالات من المراقب المرتفع.",
          "التجديف في النهر.",
          "التصوير الفوتوغرافي."
        ],
        program: [
          "اليوم الأول: المشي على جسر Knife Edge Bridge لرؤية الشلالات.",
          "اليوم الثاني: ركوب القارب لاستكشاف نهر زامبيزي.",
          "اليوم الثالث: مشاهدة الشلالات من منصة المراقبة.",
          "اليوم الرابع: تجربة التجديف في نهر زامبيزي.",
          "اليوم الخامس: التقاط الصور الاحترافية للشلالات."
        ],
        loction: "الحدود بين زامبيا وزيمبابوي",
        season: "الربيع والخريف",
        tripType: "استكشاف",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "شلالات بان جيوك",
        id: 30,
        categoryId: 6,
        imageUrl:
            "https://images.pexels.com/photos/6872865/pexels-photo-6872865.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "شلالات بان جيوك تقع على الحدود بين الصين وفيتنام، وتشتهر بجمالها الطبيعي وثقافتها المحلية. تعتبر وجهة مثالية للاستكشاف الثقافي والطبيعي.",
        activities: [
          "زيارة القرى القريبة من الشلالات.",
          "ركوب القوارب لاستكشاف الشلالات.",
          "التنزه في المنطقة المحيطة.",
          "تصوير الشلالات والطبيعة المحيطة.",
          "تذوق الأطعمة المحلية."
        ],
        program: [
          "اليوم الأول: زيارة القرى القريبة والتعرف على حياة السكان المحليين.",
          "اليوم الثاني: ركوب القوارب بالقرب من الشلالات.",
          "اليوم الثالث: التنزه في المنطقة الطبيعية المحيطة بالشلالات.",
          "اليوم الرابع: تصوير الشلالات والمناظر الطبيعية.",
          "اليوم الخامس: تجربة الأطعمة المحلية في المنطقة."
        ],
        loction: "الحدود بين الصين وفيتنام",
        season: "الصيف والخريف",
        tripType: "استكشاف ثقافي وطبيعي",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "جزيرة المالديف",
        id: 31,
        categoryId: 7,
        imageUrl:
            "https://images.pexels.com/photos/1450353/pexels-photo-1450353.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "جزيرة المالديف تقع في المحيط الهندي، وتشتهر بمياهها الزرقاء الصافية وشواطئها الرملية. تعتبر وجهة مثالية للاسترخاء والاستجمام.",
        activities: [
          "السباحة في المياه الزرقاء الصافية.",
          "تجربة الغوص لمشاهدة الشعب المرجانية.",
          "الاسترخاء على الشاطئ الرملي.",
          "تناول العشاء على البحر.",
          "الإقامة في الأكواخ العائمة."
        ],
        program: [
          "اليوم الأول: السباحة والاستمتاع بالمياه الزرقاء الصافية.",
          "اليوم الثاني: الغوص لمشاهدة الشعب المرجانية والأسماك الملونة.",
          "اليوم الثالث: الاسترخاء على الشاطئ وقراءة كتاب.",
          "اليوم الرابع: تناول عشاء فاخر على البحر في أجواء رومانسية.",
          "اليوم الخامس: الإقامة في الأكواخ العائمة والاستمتاع بالهدوء."
        ],
        loction: "المحيط الهندي",
        season: "الشتاء والربيع",
        tripType: "استرخاء واستجمام",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "جزيرة سانتوريني",
        id: 32,
        categoryId: 7,
        imageUrl:
            "https://images.pexels.com/photos/161815/santorini-oia-greece-water-161815.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "جزيرة سانتوريني تقع في اليونان، وتشتهر بمناظرها الخلابة وكنائسها البيضاء ذات القباب الزرقاء. تعتبر وجهة مثالية للاسترخاء والاستكشاف.",
        activities: [
          "مشاهدة غروب الشمس من منطقة أويا.",
          "زيارة الكنائس البيضاء ذات القباب الزرقاء.",
          "التنزه في الشوارع المرصوفة بالحجارة.",
          "السباحة في البحر الأبيض المتوسط.",
          "تجربة المأكولات اليونانية التقليدية."
        ],
        program: [
          "اليوم الأول: مشاهدة غروب الشمس من منطقة أويا.",
          "اليوم الثاني: زيارة الكنائس البيضاء ذات القباب الزرقاء.",
          "اليوم الثالث: التنزه في الشوارع التقليدية والتقاط الصور.",
          "اليوم الرابع: السباحة والاستمتاع بمياه البحر الأبيض المتوسط.",
          "اليوم الخامس: تذوق المأكولات اليونانية في أحد المطاعم المطلة على البحر."
        ],
        loction: "اليونان",
        season: "الصيف والخريف",
        tripType: "استرخاء واستكشاف",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "جزيرة بالي",
        id: 33,
        categoryId: 7,
        imageUrl:
            "https://smithway.org/wp-content/uploads/2022/12/shutterstock_518868568-pr-250417-Stone-arch-over-the-sea-at-the-rocky-coastline-on-Nusa-Penida-island-near-Bali-in-Indonesia.jpg",
        informaion:
            "جزيرة بالي تقع في إندونيسيا، وتشتهر بثقافتها الغنية ومناظرها الطبيعية الخلابة. تعتبر وجهة مثالية للاسترخاء والاستكشاف الثقافي.",
        activities: [
          "زيارة حقول الأرز المدرجة.",
          "ممارسة اليوغا في المنتجعات الصحية.",
          "التنزه في الغابات المقدسة.",
          "تعلم الطهي الإندونيسي.",
          "الاسترخاء على الشواطئ الذهبية."
        ],
        program: [
          "اليوم الأول: زيارة حقول الأرز المدرجة والاستمتاع بالمناظر الطبيعية.",
          "اليوم الثاني: ممارسة اليوغا في أحد المنتجعات الصحية الشهيرة.",
          "اليوم الثالث: التنزه في الغابات المقدسة ومشاهدة القرود.",
          "اليوم الرابع: تعلم الطهي الإندونيسي التقليدي.",
          "اليوم الخامس: قضاء يوم على الشاطئ الذهبي والاسترخاء."
        ],
        loction: "إندونيسيا",
        season: "الصيف والخريف",
        tripType: "استرخاء واستكشاف ثقافي",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "جزيرة سيشل",
        id: 34,
        categoryId: 7,
        imageUrl:
            "https://images.pexels.com/photos/12987502/pexels-photo-12987502.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "جزيرة سيشل تقع في المحيط الهندي، وتشتهر بشواطئها ذات الرمال البيضاء ومياهها الفيروزية. تعتبر وجهة مثالية للاسترخاء والرومانسية.",
        activities: [
          "الاسترخاء على شواطئ الرمال البيضاء.",
          "السباحة في المياه الفيروزية.",
          "ركوب القوارب لاستكشاف الجزر الصغيرة.",
          "تناول الطعام على الشاطئ.",
          "الاستمتاع بالعلاجات الطبيعية في المنتجعات."
        ],
        program: [
          "اليوم الأول: الاسترخاء على الشواطئ ذات الرمال البيضاء.",
          "اليوم الثاني: السباحة في المياه الفيروزية الصافية.",
          "اليوم الثالث: ركوب القوارب لاستكشاف الجزر المحيطة.",
          "اليوم الرابع: تناول وجبة غداء على الشاطئ في أجواء هادئة.",
          "اليوم الخامس: الاستمتاع بجلسة تدليك وعلاج طبيعي في أحد المنتجعات."
        ],
        loction: "المحيط الهندي",
        season: "الشتاء والربيع",
        tripType: "استرخاء ورومانسية",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "جزيرة هاواي",
        id: 35,
        categoryId: 7,
        imageUrl:
            "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8rWqdEoQITgnjxDcbNPcDRozlKbtM-HM5ww&s",
        informaion:
            "جزيرة هاواي تقع في الولايات المتحدة الأمريكية، وتشتهر ببراكينها النشطة وشواطئها الخلابة. تعتبر وجهة مثالية للمغامرات والاسترخاء.",
        activities: [
          "ركوب الأمواج.",
          "استكشاف البراكين النشطة.",
          "التنزه في الشلالات والغابات.",
          "تعلم الرقص التقليدي (الهولا).",
          "الاسترخاء على الشاطئ."
        ],
        program: [
          "اليوم الأول: ركوب الأمواج في شواطئ هاواي الشهيرة.",
          "اليوم الثاني: زيارة منطقة البراكين النشطة والتقاط الصور.",
          "اليوم الثالث: التنزه في الغابات والشلالات القريبة.",
          "اليوم الرابع: تعلم الرقص التقليدي (الهولا) مع السكان المحليين.",
          "اليوم الخامس: قضاء يوم للاسترخاء على الشاطئ والاستمتاع بالمناظر."
        ],
        loction: "الولايات المتحدة الأمريكية",
        season: "الصيف",
        tripType: "مغامرات واسترخاء",
        isInSummer: true,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "مدينة روما",
        id: 36,
        categoryId: 8,
        imageUrl:
            "https://images.pexels.com/photos/356966/pexels-photo-356966.jpeg?auto=compress&cs=tinysrgb&w=1260&h=750&dpr=1",
        informaion:
            "مدينة روما تقع في إيطاليا، وتشتهر بمعالمها التاريخية مثل الكولوسيوم ونافورة تريفي. تعتبر وجهة مثالية للاستكشاف الثقافي والتاريخي.",
        activities: [
          "زيارة الكولوسيوم.",
          "التنزه في ساحة نافونا.",
          "استكشاف متحف الفاتيكان.",
          "رمي قطعة نقدية في نافورة تريفي.",
          "تجربة المأكولات الإيطالية التقليدية."
        ],
        program: [
          "اليوم الأول: زيارة الكولوسيوم والتعرف على تاريخه.",
          "اليوم الثاني: التنزه في ساحة نافونا والتقاط الصور.",
          "اليوم الثالث: زيارة متحف الفاتيكان واستكشاف الفن والتحف.",
          "اليوم الرابع: زيارة نافورة تريفي ورمي عملة نقدية لتمني العودة إلى روما.",
          "اليوم الخامس: تذوق البيتزا الإيطالية في مطعم تقليدي."
        ],
        loction: "إيطاليا",
        season: "الربيع والخريف",
        tripType: "استكشاف ثقافي وتاريخي",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "مدينة الأقصر",
        id: 37,
        categoryId: 8,
        imageUrl:
            "https://images.pexels.com/photos/18934668/pexels-photo-18934668/free-photo-of-ancient-luxor-temple-in-egypt.jpeg?auto=compress&cs=tinysrgb&w=600&lazy=load",
        informaion:
            "مدينة الأقصر تقع في مصر، وتشتهر بمعابدها الفرعونية مثل الكرنك ووادي الملوك. تعتبر وجهة مثالية للاستكشاف التاريخي.",
        activities: [
          "زيارة معبد الكرنك.",
          "جولة بالمراكب في نهر النيل.",
          "استكشاف وادي الملوك.",
          "زيارة معبد حتشبسوت.",
          "حضور عرض الصوت والضوء."
        ],
        program: [
          "اليوم الأول: زيارة معبد الكرنك ومشاهدة الآثار الفرعونية.",
          "اليوم الثاني: جولة بالمراكب في نهر النيل.",
          "اليوم الثالث: استكشاف وادي الملوك وزيارة المقابر الملكية.",
          "اليوم الرابع: زيارة معبد حتشبسوت والتعرف على تاريخ الملكة.",
          "اليوم الخامس: حضور عرض الصوت والضوء بمعبد الكرنك."
        ],
        loction: "مصر",
        season: "الشتاء والربيع",
        tripType: "استكشاف تاريخي",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "مدينة إسطنبول",
        id: 38,
        categoryId: 8,
        imageUrl:
            "https://images.pexels.com/photos/1549326/pexels-photo-1549326.jpeg?auto=compress&cs=tinysrgb&w=400",
        informaion:
            "مدينة إسطنبول تقع في تركيا، وتشتهر بمعالمها التاريخية مثل آيا صوفيا وقصر توبكابي. تعتبر وجهة مثالية للاستكشاف الثقافي والتاريخي.",
        activities: [
          "زيارة آيا صوفيا.",
          "التنزه في البازار الكبير.",
          "جولة في مضيق البوسفور.",
          "استكشاف قصر توبكابي.",
          "تذوق الحلويات التركية."
        ],
        program: [
          "اليوم الأول: زيارة آيا صوفيا والتعرف على تاريخها.",
          "اليوم الثاني: التنزه والتسوق في البازار الكبير.",
          "اليوم الثالث: جولة بحرية في مضيق البوسفور.",
          "اليوم الرابع: استكشاف قصر توبكابي وحدائقه.",
          "اليوم الخامس: تذوق البقلاوة والكنافة التركية في أحد المقاهي التقليدية."
        ],
        loction: "تركيا",
        season: "الربيع والخريف",
        tripType: "استكشاف ثقافي وتاريخي",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
      Trip(
        name: "مدينة مراكش",
        id: 39,
        categoryId: 8,
        imageUrl:
            "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRJgsQzzs4RQncX2FTxdIEZm_2inuMUyG2qBg&s",
        informaion:
            "مدينة مراكش تقع في المغرب، وتشتهر بأسواقها التقليدية ومعالمها الثقافية مثل جامع الفنا. تعتبر وجهة مثالية للاستكشاف الثقافي.",
        activities: [
          "زيارة جامع الفنا.",
          "التجول في الأسواق التقليدية.",
          "زيارة حدائق ماجوريل.",
          "استكشاف قصر البديع.",
          "تجربة الحمام المغربي."
        ],
        program: [
          "اليوم الأول: زيارة جامع الفنا والاستمتاع بالأجواء الشعبية.",
          "اليوم الثاني: التجول في الأسواق التقليدية وشراء الهدايا.",
          "اليوم الثالث: زيارة حدائق ماجوريل والتقاط الصور.",
          "اليوم الرابع: استكشاف قصر البديع والتعرف على تاريخه.",
          "اليوم الخامس: تجربة الحمام المغربي للاسترخاء."
        ],
        loction: "المغرب",
        season: "الشتاء والربيع",
        tripType: "استكشاف ثقافي",
        isInSummer: false,
        isInWinter: true,
        isForFamilies: true,
      ),
      Trip(
        name: "مدينة القدس",
        id: 40,
        categoryId: 8,
        imageUrl:
            "https://images.pexels.com/photos/11759765/pexels-photo-11759765.jpeg?auto=compress&cs=tinysrgb&w=600&lazy=load",
        informaion:
            "مدينة القدس تقع في فلسطين، وتشتهر بمعالمها الدينية والتاريخية مثل المسجد الأقصى وكنيسة القيامة. تعتبر وجهة مثالية للاستكشاف التاريخي والديني.",
        activities: [
          "زيارة المسجد الأقصى وقبة الصخرة.",
          "استكشاف البلدة القديمة.",
          "التنزه في سوق القطانين.",
          "زيارة كنيسة القيامة.",
          "تناول الأطعمة الفلسطينية التقليدية."
        ],
        program: [
          "اليوم الأول: زيارة المسجد الأقصى وقبة الصخرة للصلاة والتأمل.",
          "اليوم الثاني: استكشاف شوارع البلدة القديمة ومعالمها.",
          "اليوم الثالث: التنزه في سوق القطانين وشراء التذكارات.",
          "اليوم الرابع: زيارة كنيسة القيامة والتعرف على تاريخها.",
          "اليوم الخامس: تناول المأكولات الفلسطينية مثل المسخن والكنافة."
        ],
        loction: "فلسطين",
        season: "الربيع والخريف",
        tripType: "استكشاف تاريخي وديني",
        isInSummer: false,
        isInWinter: false,
        isForFamilies: true,
      ),
    ];
  }
}
